## [liquibase-docs-staging](https://liquibase.app.spacelift.io/stack/liquibase-docs-staging/run/01J3GWQQV73S4696SJZ971W6BF) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/concepts/advanced/logicalfilepath.html"]: Refreshing state... [id=/concepts/advanced/logicalfilepath.html]
aws_s3_object.redirects["/commands/liquibase-start/init-start-h2.html"]: Refreshing state... [id=/commands/liquibase-start/init-start-h2.html]
aws_s3_object.redirects["/change-types/community/create-procedure.html"]: Refreshing state... [id=/change-types/community/create-procedure.html]
aws_s3_object.redirects["/commands/config-ref/output-line-separator.html"]: Refreshing state... [id=/commands/config-ref/output-line-separator.html]
aws_s3_object.redirects["/checks-packages"]: Refreshing state... [id=/checks-packages]
aws_s3_object.redirects["/commands/quality-checks/checks-copy.html"]: Refreshing state... [id=/commands/quality-checks/checks-copy.html]
aws_s3_object.redirects["/feature-flags/readmes/Flipt Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flipt Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/updatetotag.html"]: Refreshing state... [id=/commands/updatetotag.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/home.html"]: Refreshing state... [id=/tools-integrations/ant/commands/home.html]
aws_s3_object.redirects["/commands/pro/checks-bulk-set.html"]: Refreshing state... [id=/commands/pro/checks-bulk-set.html]
aws_s3_object.redirects["/tools-integrations/gradle/getting-started-liquibase-gradle.html"]: Refreshing state... [id=/tools-integrations/gradle/getting-started-liquibase-gradle.html]
aws_s3_object.redirects["/start/install/tutorials/mssql-windows-integrated-security.html"]: Refreshing state... [id=/start/install/tutorials/mssql-windows-integrated-security.html]
aws_s3_object.redirects["/change-types/community/add-primary-key.html"]: Refreshing state... [id=/change-types/community/add-primary-key.html]
aws_s3_object.redirects["/commands/registerchangelog.html"]: Refreshing state... [id=/commands/registerchangelog.html]
aws_s3_object.redirects["/tools-integrations/maven/using-liquibase-and-maven-pom-file.html"]: Refreshing state... [id=/tools-integrations/maven/using-liquibase-and-maven-pom-file.html]
aws_s3_object.redirects["/databasechangeloghistory"]: Refreshing state... [id=/databasechangeloghistory]
aws_s3_object.redirects["/commands/rollbacktodate.html"]: Refreshing state... [id=/commands/rollbacktodate.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-psql-integration.html]
aws_s3_object.redirects["/concepts/basic/json-format.html"]: Refreshing state... [id=/concepts/basic/json-format.html]
aws_s3_object.redirects["/popular-topics.html"]: Refreshing state... [id=/popular-topics.html]
aws_s3_object.redirects["/change-types/community/add-foreign-key-constraint.html"]: Refreshing state... [id=/change-types/community/add-foreign-key-constraint.html]
aws_s3_object.redirects["/commands/community/home.html"]: Refreshing state... [id=/commands/community/home.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-copy.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-copy.html]
aws_s3_object.redirects["/concepts/advanced/objectquotingstrategy.html"]: Refreshing state... [id=/concepts/advanced/objectquotingstrategy.html]
aws_s3_object.redirects["/change-types/community/add-lookup-table.html"]: Refreshing state... [id=/change-types/community/add-lookup-table.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-linux-macos.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/rollbackfuturedatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/rollbackfuturedatabase.html]
aws_s3_object.redirects["/concepts/installation/installation-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/installation-linux-unix-mac.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagsmith Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flagsmith Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/quality-checks/checks-enable.html"]: Refreshing state... [id=/commands/quality-checks/checks-enable.html]
aws_s3_object.redirects["/commands/pro/rollbackonechangeset.html"]: Refreshing state... [id=/commands/pro/rollbackonechangeset.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cockroachdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cockroachdb.html]
aws_s3_object.redirects["/commands/quality-checks/checks-customize.html"]: Refreshing state... [id=/commands/quality-checks/checks-customize.html]
aws_s3_object.redirects["/feature-flags/readmes/GrowthBook Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/GrowthBook Feature Flags Extension.html]
aws_s3_object.redirects["/concepts/advanced/quality-checks.html"]: Refreshing state... [id=/concepts/advanced/quality-checks.html]
aws_s3_object.redirects["/concepts/basic/liquibase-configuration-reference.html"]: Refreshing state... [id=/concepts/basic/liquibase-configuration-reference.html]
aws_s3_object.redirects["/concepts/basic/changelog-parameters.html"]: Refreshing state... [id=/concepts/basic/changelog-parameters.html]
aws_s3_object.redirects["/start/install/tutorials/informix.html"]: Refreshing state... [id=/start/install/tutorials/informix.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran.html]
aws_s3_object.redirects["/concepts/advanced/exception-handling.html"]: Refreshing state... [id=/concepts/advanced/exception-handling.html]
aws_s3_object.redirects["/DATABASECHANGELOGHISTORY"]: Refreshing state... [id=/DATABASECHANGELOGHISTORY]
aws_s3_object.redirects["/install/tutorials/sqlite.html"]: Refreshing state... [id=/install/tutorials/sqlite.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/home.html"]: Refreshing state... [id=/tools-integrations/secrets-management/home.html]
aws_s3_object.redirects["/start/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/start/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/commands/futurerollbackcountsql.html"]: Refreshing state... [id=/commands/futurerollbackcountsql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-clearCheckSums.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-clearCheckSums.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-tablespace-name.html"]: Refreshing state... [id=/commands/config-ref/liquibase-tablespace-name.html]
aws_s3_object.redirects["/change-types/community/alter-sequence.html"]: Refreshing state... [id=/change-types/community/alter-sequence.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-amazon-documentdb.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-amazon-documentdb.html]
aws_s3_object.redirects["/concepts/installation/installation-windows.html"]: Refreshing state... [id=/concepts/installation/installation-windows.html]
aws_s3_object.redirects["/tools-integrations/ant/getting-started-liquibase-ant.html"]: Refreshing state... [id=/tools-integrations/ant/getting-started-liquibase-ant.html]
aws_s3_object.redirects["/concepts/advanced/generate-changeset-created-values.html"]: Refreshing state... [id=/concepts/advanced/generate-changeset-created-values.html]
aws_s3_object.redirects["/commands/snapshot.html"]: Refreshing state... [id=/commands/snapshot.html]
aws_s3_object.redirects["/start/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset-sql.html]
aws_s3_object.redirects["/feature-flags/readmes/GitLab Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/GitLab Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/quality-checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/lab-quality-checks.html]
aws_s3_object.redirects["/install/tutorials/mariadb.html"]: Refreshing state... [id=/install/tutorials/mariadb.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-linux-macos.html]
aws_s3_object.redirects["/commands/maintenance/clear-checksums.html"]: Refreshing state... [id=/commands/maintenance/clear-checksums.html]
aws_s3_object.redirects["/start/install/tutorials/interbase.html"]: Refreshing state... [id=/start/install/tutorials/interbase.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-register-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-register-changelog.html]
aws_s3_object.redirects["/change-types/community/drop-sequence.html"]: Refreshing state... [id=/change-types/community/drop-sequence.html]
aws_s3_object.redirects["/quality-checks.html"]: Refreshing state... [id=/quality-checks.html]
aws_s3_object.redirects["/commands/maintenance/tag.html"]: Refreshing state... [id=/commands/maintenance/tag.html]
aws_s3_object.redirects["/tools-integrations/springboot/using-springboot-with-maven.html"]: Refreshing state... [id=/tools-integrations/springboot/using-springboot-with-maven.html]
aws_s3_object.redirects["/install/tutorials/interbase.html"]: Refreshing state... [id=/install/tutorials/interbase.html]
aws_s3_object.redirects["/concepts/advanced/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/concepts/advanced/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/voltdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/voltdb.html]
aws_s3_object.redirects["/mdc"]: Refreshing state... [id=/mdc]
aws_s3_object.redirects["/change-types/community/drop-view.html"]: Refreshing state... [id=/change-types/community/drop-view.html]
aws_s3_object.redirects["/change-types/pro/home.html"]: Refreshing state... [id=/change-types/pro/home.html]
aws_s3_object.redirects["/start/tutorials/postgresql/google-cloud-sql.html"]: Refreshing state... [id=/start/tutorials/postgresql/google-cloud-sql.html]
aws_s3_object.redirects["/commands/community/deactivatechangelog.html"]: Refreshing state... [id=/commands/community/deactivatechangelog.html]
aws_s3_object.redirects["/documentation/maven/maven_changelogsyncsql.html"]: Refreshing state... [id=/documentation/maven/maven_changelogsyncsql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-db-doc.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-db-doc.html]
aws_s3_object.redirects["/tools-integrations/labs/variables.html"]: Refreshing state... [id=/tools-integrations/labs/variables.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-windows.html]
aws_s3_object.redirects["/install/tutorials/firebird.html"]: Refreshing state... [id=/install/tutorials/firebird.html]
aws_s3_object.redirects["/install/liquibase-installation-troubleshooting.html"]: Refreshing state... [id=/install/liquibase-installation-troubleshooting.html]
aws_s3_object.redirects["/concepts/changelogs/runwith.html"]: Refreshing state... [id=/concepts/changelogs/runwith.html]
aws_s3_object.redirects["/operation-reports"]: Refreshing state... [id=/operation-reports]
aws_s3_object.redirects["/commands/quality-checks/bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/bulk-set.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-check.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/use-sql-plus-integration.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro/using-mongosh-changelog.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro/using-mongosh-changelog.html]
aws_s3_object.redirects["/commands/quality-checks/quality-checks-json-object.html"]: Refreshing state... [id=/commands/quality-checks/quality-checks-json-object.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.11.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.11.0.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html]
aws_s3_object.redirects["/commands/hub/sync-hub.html"]: Refreshing state... [id=/commands/hub/sync-hub.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-delete.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-delete.html]
aws_s3_object.redirects["/change-types/community/load-data.html"]: Refreshing state... [id=/change-types/community/load-data.html]
aws_s3_object.redirects["/commands/config-ref/should-snapshot-data-parameter.html"]: Refreshing state... [id=/commands/config-ref/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mysql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mysql.html]
aws_s3_object.redirects["/change-tracking/maintenance/tag.html"]: Refreshing state... [id=/change-tracking/maintenance/tag.html]
aws_s3_object.redirects["/install/tutorials/mongodb.html"]: Refreshing state... [id=/install/tutorials/mongodb.html]
aws_s3_object.redirects["/commands/maintenance/unexpected-changesets.html"]: Refreshing state... [id=/commands/maintenance/unexpected-changesets.html]
aws_s3_object.redirects["/start/tutorials/hsqldb.html"]: Refreshing state... [id=/start/tutorials/hsqldb.html]
aws_s3_object.redirects["/commands/quality-checks/checks-show.html"]: Refreshing state... [id=/commands/quality-checks/checks-show.html]
aws_s3_object.redirects["/start/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/commands/community/snapshotreference.html"]: Refreshing state... [id=/commands/community/snapshotreference.html]
aws_s3_object.redirects["/flow.html"]: Refreshing state... [id=/flow.html]
aws_s3_object.redirects["/tools-integrations/remote-files/create-changelogs-s3.html"]: Refreshing state... [id=/tools-integrations/remote-files/create-changelogs-s3.html]
aws_s3_object.redirects["/commands/community/calculatechecksum.html"]: Refreshing state... [id=/commands/community/calculatechecksum.html]
aws_s3_object.redirects["/workflows/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/workflows/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migrate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migrate.html]
aws_s3_object.redirects["/concepts/basic/yaml-format.html"]: Refreshing state... [id=/concepts/basic/yaml-format.html]
aws_s3_object.redirects["/workflows/liquibase-community/generating-docs.html"]: Refreshing state... [id=/workflows/liquibase-community/generating-docs.html]
aws_s3_object.redirects["/start/tutorials/yugabytedb.html"]: Refreshing state... [id=/start/tutorials/yugabytedb.html]
aws_s3_object.redirects["/concepts/advanced/outputfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/outputfile-parameter.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.2.html]
aws_s3_object.redirects["/commands/rollbacksqltag.html"]: Refreshing state... [id=/commands/rollbacksqltag.html]
aws_s3_object.redirects["/concepts/changelogs/contexts.html"]: Refreshing state... [id=/concepts/changelogs/contexts.html]
aws_s3_object.redirects["/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.20.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.20.0.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-option-warn.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.4.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.4.2.html]
aws_s3_object.redirects["/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-synchub.html]
aws_s3_object.redirects["/commands/change-tracking/set-contexts.html"]: Refreshing state... [id=/commands/change-tracking/set-contexts.html]
aws_s3_object.redirects["/concepts/databasechangelog.html"]: Refreshing state... [id=/concepts/databasechangelog.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/concepts/working-with-quality-checks.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/concepts/advanced/enddelimiter-sql-attribute.html"]: Refreshing state... [id=/concepts/advanced/enddelimiter-sql-attribute.html]
aws_s3_object.redirects["/concepts/advanced/include-system-classpath-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-system-classpath-parameter.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sqlite.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sqlite.html]
aws_s3_object.redirects["/change-types/pro/drop-package-body.html"]: Refreshing state... [id=/change-types/pro/drop-package-body.html]
aws_s3_object.redirects["/commands/quality-checks/copy.html"]: Refreshing state... [id=/commands/quality-checks/copy.html]
aws_s3_object.redirects["/concepts/advanced/include-catalog-in-specification-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-catalog-in-specification-parameter.html]
aws_s3_object.redirects["/start/install/tutorials/cassandra-astra.html"]: Refreshing state... [id=/start/install/tutorials/cassandra-astra.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/tools-integrations/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync.html]
aws_s3_object.redirects["/commands/update/drop-all.html"]: Refreshing state... [id=/commands/update/drop-all.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/diffdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/diffdatabase.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-tablespace-name.html"]: Refreshing state... [id=/concepts/advanced/liquibase-tablespace-name.html]
aws_s3_object.redirects["/start/install/tutorials/mysql.html"]: Refreshing state... [id=/start/install/tutorials/mysql.html]
aws_s3_object.redirects["/start/install/tutorials/mongodb.html"]: Refreshing state... [id=/start/install/tutorials/mongodb.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html]
aws_s3_object.redirects["/concepts/ant/index.html"]: Refreshing state... [id=/concepts/ant/index.html]
aws_s3_object.redirects["/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html"]: Refreshing state... [id=/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html]
aws_s3_object.redirects["/feature-flags/readmes/Example.html"]: Refreshing state... [id=/feature-flags/readmes/Example.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql.html]
aws_s3_object.redirects["/commands/community/registerChangeLog.html"]: Refreshing state... [id=/commands/community/registerChangeLog.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-generate-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-generate-changelog.html]
aws_s3_object.redirects["/concepts/changelogs/include.html"]: Refreshing state... [id=/concepts/changelogs/include.html]
aws_s3_object.redirects["/commands/tagexists.html"]: Refreshing state... [id=/commands/tagexists.html]
aws_s3_object.redirects["/start/tutorials/h2.html"]: Refreshing state... [id=/start/tutorials/h2.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.18.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.18.0.html]
aws_s3_object.redirects["/change-types/community/drop-column.html"]: Refreshing state... [id=/change-types/community/drop-column.html]
aws_s3_object.redirects["/start/tutorials/maxdb.html"]: Refreshing state... [id=/start/tutorials/maxdb.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/ff4j-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/ff4j-feature-flags-extension.html]
aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/working-with-quality-checks.html]
aws_s3_object.redirects["/install/tutorials/impala-hive.html"]: Refreshing state... [id=/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/commands/changelogsynctotag.html"]: Refreshing state... [id=/commands/changelogsynctotag.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html]
aws_s3_object.redirects["/concepts/basic/other-formats.html"]: Refreshing state... [id=/concepts/basic/other-formats.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-updateSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-updateSQL.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-schema-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-schema-name-parameter.html]
aws_s3_object.redirects["/mongodb"]: Refreshing state... [id=/mongodb]
aws_s3_object.redirects["/start/tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/start/tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/feature-flags/readmes/Flipt Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flipt Feature Flags Extension.html]
aws_s3_object.redirects["/workflows/liquibase-community/homebrew-installation-for-macos.html"]: Refreshing state... [id=/workflows/liquibase-community/homebrew-installation-for-macos.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/quality-checks-databases.html]
aws_s3_object.redirects["/install/tutorials/yugabytedb.html"]: Refreshing state... [id=/install/tutorials/yugabytedb.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-user-defined-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-user-defined-pattern-check.html]
aws_s3_object.redirects["/commands/pro/rollbackoneupdate.html"]: Refreshing state... [id=/commands/pro/rollbackoneupdate.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.19.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.19.0.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-release-locks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-release-locks.html]
aws_s3_object.redirects["/commands/quality-checks/show.html"]: Refreshing state... [id=/commands/quality-checks/show.html]
aws_s3_object.redirects["/change-types/community/rename-sequence.html"]: Refreshing state... [id=/change-types/community/rename-sequence.html]
aws_s3_object.redirects["/commands/quality-checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/object-name-must-not-match.html]
aws_s3_object.redirects["/install/tutorials/cassandra.html"]: Refreshing state... [id=/install/tutorials/cassandra.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/tools-integrations/remote-files/searchpath.html"]: Refreshing state... [id=/tools-integrations/remote-files/searchpath.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-catalog-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-catalog-name-parameter.html]
aws_s3_object.redirects["/concepts/basic/changeset.html"]: Refreshing state... [id=/concepts/basic/changeset.html]
aws_s3_object.redirects["/commands/community/registerchangelog.html"]: Refreshing state... [id=/commands/community/registerchangelog.html]
aws_s3_object.redirects["/feature-flags/readmes/Usage.html"]: Refreshing state... [id=/feature-flags/readmes/Usage.html]
aws_s3_object.redirects["/concepts/advanced/column.html"]: Refreshing state... [id=/concepts/advanced/column.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/rollbackdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/rollbackdatabase.html]
aws_s3_object.redirects["/change-types/community/drop-index.html"]: Refreshing state... [id=/change-types/community/drop-index.html]
aws_s3_object.redirects["/start/tutorials/postgresql/postgres-aws-aurora.html"]: Refreshing state... [id=/start/tutorials/postgresql/postgres-aws-aurora.html]
aws_s3_object.redirects["/start/tutorials/db2onz.html"]: Refreshing state... [id=/start/tutorials/db2onz.html]
aws_s3_object.redirects["/start/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html"]: Refreshing state... [id=/start/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html]
aws_s3_object.redirects["/commands/config-ref/database-class.html"]: Refreshing state... [id=/commands/config-ref/database-class.html]
aws_s3_object.redirects["/concepts/json-format.html"]: Refreshing state... [id=/concepts/json-format.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-disable.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-disable.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-list-locks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-list-locks.html]
aws_s3_object.redirects["/commands/listlocks.html"]: Refreshing state... [id=/commands/listlocks.html]
aws_s3_object.redirects["/commands/update/execute-sql.html"]: Refreshing state... [id=/commands/update/execute-sql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-context-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-context-check.html]
aws_s3_object.redirects["/commands/clearchecksums.html"]: Refreshing state... [id=/commands/clearchecksums.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.0.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-run-job-pipeline-stage-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-run-job-pipeline-stage-with-spinnaker.html]
aws_s3_object.redirects["/commands/community/history.html"]: Refreshing state... [id=/commands/community/history.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-warn.html]
aws_s3_object.redirects["/commands/snapshot/generate-changelog.html"]: Refreshing state... [id=/commands/snapshot/generate-changelog.html]
aws_s3_object.redirects["/change-types/community/tag-database.html"]: Refreshing state... [id=/change-types/community/tag-database.html]
aws_s3_object.redirects["/concepts/advanced/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/concepts/advanced/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/concepts/installation/setup-gitlab-cicd.html"]: Refreshing state... [id=/concepts/installation/setup-gitlab-cicd.html]
aws_s3_object.redirects["/start/install/tutorials/sap-hana.html"]: Refreshing state... [id=/start/install/tutorials/sap-hana.html]
aws_s3_object.redirects["/commands/quality-checks/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/commands/init/hub.html"]: Refreshing state... [id=/commands/init/hub.html]
aws_s3_object.redirects["/install/tutorials/sap-sql-anywhere.html"]: Refreshing state... [id=/install/tutorials/sap-sql-anywhere.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-sql.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-sql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-truncate-table-warn.html]
aws_s3_object.redirects["/commands/liquibase-start/init-project.html"]: Refreshing state... [id=/commands/liquibase-start/init-project.html]
aws_s3_object.redirects["/commands/community/marknextchangesetransql.html"]: Refreshing state... [id=/commands/community/marknextchangesetransql.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran-sql.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran-sql.html]
aws_s3_object.redirects["/commands/change-tracking/tag-exists.html"]: Refreshing state... [id=/commands/change-tracking/tag-exists.html]
aws_s3_object.redirects["/start/install/tutorials/mariadb.html"]: Refreshing state... [id=/start/install/tutorials/mariadb.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html]
aws_s3_object.redirects["/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html"]: Refreshing state... [id=/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/updatedatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/updatedatabase.html]
aws_s3_object.redirects["/commands/quality-checks/object-name-must-match.html"]: Refreshing state... [id=/commands/quality-checks/object-name-must-match.html]
aws_s3_object.redirects["/change-types/community/rename-column.html"]: Refreshing state... [id=/change-types/community/rename-column.html]
aws_s3_object.redirects["/start/tutorials/neo4j.html"]: Refreshing state... [id=/start/tutorials/neo4j.html]
aws_s3_object.redirects["/commands/maintenance/calculate-checksum.html"]: Refreshing state... [id=/commands/maintenance/calculate-checksum.html]
aws_s3_object.redirects["/install/tutorials/home.html"]: Refreshing state... [id=/install/tutorials/home.html]
aws_s3_object.redirects["/concepts/advanced/should-snapshot-data-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-windows.html]
aws_s3_object.redirects["/start/tutorials/mongodb/home.html"]: Refreshing state... [id=/start/tutorials/mongodb/home.html]
aws_s3_object.redirects["/commands/marknextchangesetran.html"]: Refreshing state... [id=/commands/marknextchangesetran.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-windows.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-macos.html]
aws_s3_object.redirects["/concepts/installation/liquibase-system-requirements.html"]: Refreshing state... [id=/concepts/installation/liquibase-system-requirements.html]
aws_s3_object.redirects["/concepts/advanced/loglevel.html"]: Refreshing state... [id=/concepts/advanced/loglevel.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdateSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdateSQL.html]
aws_s3_object.redirects["/commands/config-ref/logfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/logfile-parameter.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/aws-redshift.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/aws-redshift.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-releaseLocks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-releaseLocks.html]
aws_s3_object.redirects["/change-types/community/drop-table.html"]: Refreshing state... [id=/change-types/community/drop-table.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-databases.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.9.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.9.1.html]
aws_s3_object.redirects["/concepts/sql-format.html"]: Refreshing state... [id=/concepts/sql-format.html]
aws_s3_object.redirects["/change-types/pro/create-function.html"]: Refreshing state... [id=/change-types/pro/create-function.html]
aws_s3_object.redirects["/command-line/index.html"]: Refreshing state... [id=/command-line/index.html]
aws_s3_object.redirects["/change-types/community/add-not-null-constraint.html"]: Refreshing state... [id=/change-types/community/add-not-null-constraint.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync.html]
aws_s3_object.redirects["/start/tutorials/mongodb/using-mongosh-changelog.html"]: Refreshing state... [id=/start/tutorials/mongodb/using-mongosh-changelog.html]
aws_s3_object.redirects["/commands/pro/diff-json.html"]: Refreshing state... [id=/commands/pro/diff-json.html]
aws_s3_object.redirects["/feature-flags/readmes/GrowthBook Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/GrowthBook Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/quality-checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/quality-checks-list.html]
aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"]: Refreshing state... [id=/commands/quality-checks/checks/warn-on-use-database.html]
aws_s3_object.redirects["/start/tutorials/postgresql.html"]: Refreshing state... [id=/start/tutorials/postgresql.html]
aws_s3_object.redirects["/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/concepts/changelog-parameters.html"]: Refreshing state... [id=/concepts/changelog-parameters.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/home.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/home.html]
aws_s3_object.redirects["/2014/11/contexts-vs-labels.html"]: Refreshing state... [id=/2014/11/contexts-vs-labels.html]
aws_s3_object.redirects["/databasechangeloghistory.html"]: Refreshing state... [id=/databasechangeloghistory.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdate.html]
aws_s3_object.redirects["/start/install/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/start/install/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/concepts/basic/java-opts-environment-variable.html"]: Refreshing state... [id=/concepts/basic/java-opts-environment-variable.html]
aws_s3_object.redirects["/commands/quality-checks/checks/modify-data-type-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/modify-data-type-warn.html]
aws_s3_object.redirects["/commands/rollbackcountsql.html"]: Refreshing state... [id=/commands/rollbackcountsql.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/setup.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/setup.html]
aws_s3_object.redirects["/commands/quality-checks/configuring-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/configuring-quality-checks.html]
aws_s3_object.redirects["/commands/execute-sql.html"]: Refreshing state... [id=/commands/execute-sql.html]
aws_s3_object.redirects["/start/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/start/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/commands/generatechangelog.html"]: Refreshing state... [id=/commands/generatechangelog.html]
aws_s3_object.redirects["/start/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/start/install/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/start/install/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-futureRollbackSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-futureRollbackSQL.html]
aws_s3_object.redirects["/concepts/databasechangelog-table.html"]: Refreshing state... [id=/concepts/databasechangelog-table.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/informix.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/informix.html]
aws_s3_object.redirects["/commands/quality-checks/checks/postgres-non-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/postgres-non-reserved-keywords.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-reset.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-reset.html]
aws_s3_object.redirects["/change-types/community/sql.html"]: Refreshing state... [id=/change-types/community/sql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/snowflake.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/snowflake.html]
aws_s3_object.redirects["/install/tutorials/postgresql.html"]: Refreshing state... [id=/install/tutorials/postgresql.html]
aws_s3_object.redirects["/start/install/tutorials/hibernate.html"]: Refreshing state... [id=/start/install/tutorials/hibernate.html]
aws_s3_object.redirects["/concepts/advanced/filter-log-messages.html"]: Refreshing state... [id=/concepts/advanced/filter-log-messages.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/user.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/user.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/hashicorp-vault.html"]: Refreshing state... [id=/tools-integrations/secrets-management/hashicorp-vault.html]
aws_s3_object.redirects["/commands/community/clearchecksums.html"]: Refreshing state... [id=/commands/community/clearchecksums.html]
aws_s3_object.redirects["/change-types/community/rename-table.html"]: Refreshing state... [id=/change-types/community/rename-table.html]
aws_s3_object.redirects["/install/tutorials/apache-derby.html"]: Refreshing state... [id=/install/tutorials/apache-derby.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-update.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-update.html]
aws_s3_object.redirects["/concepts/other-formats.html"]: Refreshing state... [id=/concepts/other-formats.html]
aws_s3_object.redirects["/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/commands/community/changelogsynctotag.html"]: Refreshing state... [id=/commands/community/changelogsynctotag.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-windows.html]
aws_s3_object.redirects["/commands/status/status.html"]: Refreshing state... [id=/commands/status/status.html]
aws_s3_object.redirects["/install/tutorials/bigquery.html"]: Refreshing state... [id=/install/tutorials/bigquery.html]
aws_s3_object.redirects["/concepts/changes/sql.html"]: Refreshing state... [id=/concepts/changes/sql.html]
aws_s3_object.redirects["/install/liquibase-macos.html"]: Refreshing state... [id=/install/liquibase-macos.html]
aws_s3_object.redirects["/change-types/community/drop-unique-constraint.html"]: Refreshing state... [id=/change-types/community/drop-unique-constraint.html]
aws_s3_object.redirects["/change-types/community/drop-procedure.html"]: Refreshing state... [id=/change-types/community/drop-procedure.html]
aws_s3_object.redirects["/tools-integrations/cli/home.html"]: Refreshing state... [id=/tools-integrations/cli/home.html]
aws_s3_object.redirects["/install/liquibase-downloaded-files.html"]: Refreshing state... [id=/install/liquibase-downloaded-files.html]
aws_s3_object.redirects["/commands/synchub.html"]: Refreshing state... [id=/commands/synchub.html]
aws_s3_object.redirects["/commands/change-tracking/set-labels.html"]: Refreshing state... [id=/commands/change-tracking/set-labels.html]
aws_s3_object.redirects["/feature-flags/readmes/launchdarkly feature flags.html"]: Refreshing state... [id=/feature-flags/readmes/launchdarkly feature flags.html]
aws_s3_object.redirects["/commands/quality-checks/checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/lab-quality-checks.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sybase-enterprise.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sybase-enterprise.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync.html]
aws_s3_object.redirects["/tools-integrations/maven/workflows/hub-pom-attributes.html"]: Refreshing state... [id=/tools-integrations/maven/workflows/hub-pom-attributes.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/concepts/basic/how-liquibase-finds-files.html"]: Refreshing state... [id=/concepts/basic/how-liquibase-finds-files.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer.html]
aws_s3_object.redirects["/install/tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/install/tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/commands/marknextchangesetransql.html"]: Refreshing state... [id=/commands/marknextchangesetransql.html]
aws_s3_object.redirects["/install/tutorials/voltdb.html"]: Refreshing state... [id=/install/tutorials/voltdb.html]
aws_s3_object.redirects["/change-types/community/add-column.html"]: Refreshing state... [id=/change-types/community/add-column.html]
aws_s3_object.redirects["/commands/command-parameters.html"]: Refreshing state... [id=/commands/command-parameters.html]
aws_s3_object.redirects["/feature-flags"]: Refreshing state... [id=/feature-flags]
aws_s3_object.redirects["/change-types/community/create-table.html"]: Refreshing state... [id=/change-types/community/create-table.html]
aws_s3_object.redirects["/install/tutorials/aws-redshift.html"]: Refreshing state... [id=/install/tutorials/aws-redshift.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html]
aws_s3_object.redirects["/concepts/advanced/includeall.html"]: Refreshing state... [id=/concepts/advanced/includeall.html]
aws_s3_object.redirects["/commands/status/verbose.html"]: Refreshing state... [id=/commands/status/verbose.html]
aws_s3_object.redirects["/change-types/community/stop.html"]: Refreshing state... [id=/change-types/community/stop.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-linux.html]
aws_s3_object.redirects["/commands/community/changelogsyncsql.html"]: Refreshing state... [id=/commands/community/changelogsyncsql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.12.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.12.0.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/aws-secrets-mgr.html"]: Refreshing state... [id=/tools-integrations/secrets-management/aws-secrets-mgr.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-macos.html]
aws_s3_object.redirects["/concepts/basic/path-update.html"]: Refreshing state... [id=/concepts/basic/path-update.html]
aws_s3_object.redirects["/workflows"]: Refreshing state... [id=/workflows]
aws_s3_object.redirects["/tools-integrations/maven/commands/popular-topics.html"]: Refreshing state... [id=/tools-integrations/maven/commands/popular-topics.html]
aws_s3_object.redirects["/install/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/install/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/change-types/pro/rename-trigger.html"]: Refreshing state... [id=/change-types/pro/rename-trigger.html]
aws_s3_object.redirects["/commands/snapshot/snapshot.html"]: Refreshing state... [id=/commands/snapshot/snapshot.html]
aws_s3_object.redirects["/start/tutorials/impala-hive.html"]: Refreshing state... [id=/start/tutorials/impala-hive.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/properties.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/properties.html]
aws_s3_object.redirects["/commands/liquibase-start/home.html"]: Refreshing state... [id=/commands/liquibase-start/home.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql.html]
aws_s3_object.redirects["/start/tutorials/amazon-dynamodb/amazon-dynamodb.html"]: Refreshing state... [id=/start/tutorials/amazon-dynamodb/amazon-dynamodb.html]
aws_s3_object.redirects["/start/tutorials/aws-redshift.html"]: Refreshing state... [id=/start/tutorials/aws-redshift.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-comment-check.html]
aws_s3_object.redirects["/change-types/pro/enable-check-constraint.html"]: Refreshing state... [id=/change-types/pro/enable-check-constraint.html]
aws_s3_object.redirects["/install/supported-databases.html"]: Refreshing state... [id=/install/supported-databases.html]
aws_s3_object.redirects["/drift-reports"]: Refreshing state... [id=/drift-reports]
aws_s3_object.redirects["/commands/quality-checks/checks-disable.html"]: Refreshing state... [id=/commands/quality-checks/checks-disable.html]
aws_s3_object.redirects["/change-types/community/load-update-data.html"]: Refreshing state... [id=/change-types/community/load-update-data.html]
aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"]: Refreshing state... [id=/tools-integrations/observability/meta-data-structured-logs.html]
aws_s3_object.redirects["/commands/community/unexpectedchangesets.html"]: Refreshing state... [id=/commands/community/unexpectedchangesets.html]
aws_s3_object.redirects["/commands/updatecount.html"]: Refreshing state... [id=/commands/updatecount.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migratesql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migratesql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/rollback-required.html"]: Refreshing state... [id=/commands/quality-checks/checks/rollback-required.html]
aws_s3_object.redirects["/commands/config-ref/include-system-classpath-parameter.html"]: Refreshing state... [id=/commands/config-ref/include-system-classpath-parameter.html]
aws_s3_object.redirects["/commands/community/rollbacktodatesql.html"]: Refreshing state... [id=/commands/community/rollbacktodatesql.html]
aws_s3_object.redirects["/concepts/advanced/should-run-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-run-parameter.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsqldb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsqldb.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/release-notes.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/release-notes.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/redshift.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/redshift.html]
aws_s3_object.redirects["/install/sybase-enterprise.html"]: Refreshing state... [id=/install/sybase-enterprise.html]
aws_s3_object.redirects["/start/tutorials/hibernate.html"]: Refreshing state... [id=/start/tutorials/hibernate.html]
aws_s3_object.redirects["/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html"]: Refreshing state... [id=/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html]
aws_s3_object.redirects["/start/install/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/install/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync-sql.html]
aws_s3_object.redirects["/start/tutorials/teradata.html"]: Refreshing state... [id=/start/tutorials/teradata.html]
aws_s3_object.redirects["/commands/community/dropall.html"]: Refreshing state... [id=/commands/community/dropall.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html]
aws_s3_object.redirects["/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/feature-flags/readmes/GitLab Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/GitLab Feature Flags Extension.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-user-roles.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-user-roles.html]
aws_s3_object.redirects["/commands/community/tagexists.html"]: Refreshing state... [id=/commands/community/tagexists.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/home.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/home.html]
aws_s3_object.redirects["/database-reports"]: Refreshing state... [id=/database-reports]
aws_s3_object.redirects["/start/release-notes/liquibase-4.25.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.25.0.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hibernate.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hibernate.html]
aws_s3_object.redirects["/change-types/community/insert.html"]: Refreshing state... [id=/change-types/community/insert.html]
aws_s3_object.redirects["/commands/quality-checks/table-column-limit.html"]: Refreshing state... [id=/commands/quality-checks/table-column-limit.html]
aws_s3_object.redirects["/commands/quality-checks/disable.html"]: Refreshing state... [id=/commands/quality-checks/disable.html]
aws_s3_object.redirects["/concepts/changelogs/changelog-formats.html"]: Refreshing state... [id=/concepts/changelogs/changelog-formats.html]
aws_s3_object.redirects["/concepts/maven/index.html"]: Refreshing state... [id=/concepts/maven/index.html]
aws_s3_object.redirects["/workflows/liquibase-community/creating-config-properties.html"]: Refreshing state... [id=/workflows/liquibase-community/creating-config-properties.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-pro-certified-databases.html"]: Refreshing state... [id=/concepts/advanced/liquibase-pro-certified-databases.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/commands/updatetotagsql.html"]: Refreshing state... [id=/commands/updatetotagsql.html]
aws_s3_object.redirects["/start/install/tutorials/vertica.html"]: Refreshing state... [id=/start/install/tutorials/vertica.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/change-types/community/execute-command.htm"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/change-types/community/execute-command.htm"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/change-types/execute-command.htm" -> "/change-types/execute-command.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/change-types/community/execute-command.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/change-types/community/execute-command.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/change-types/execute-command.html"
    }

  # aws_s3_object.redirects["/custom-policy-checks"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/custom-policy-checks"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html"
    }

  # aws_s3_object.redirects["/custom-policy-checks.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/custom-policy-checks.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html"
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/pro-extensions"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/pro-extensions"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/workflows/liquibase-pro/extensions-list.html"
    }

  # aws_s3_object.redirects["/pro-extensions.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/pro-extensions.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/workflows/liquibase-pro/extensions-list.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/workflows/liquibase-community/modify-sql.html"
      ~ metadata               = {
          - "user-agent"    = "AWSTransfer" -> null
          - "user-agent-id" = "avelonis@s-53428b82285849a98" -> null
        }
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      + website_redirect       = "/change-types/modify-sql.html"
        # (10 unchanged attributes hidden)
    }

Plan: 5 to add, 4 to change, 0 to destroy.

[01J3FY630W590TD34DV3YZSMZD] Changes are GO
[01J3FY630W590TD34DV3YZSMZD] Uploading the list of managed resources...
[01J3FY630W590TD34DV3YZSMZD] Generating Infracost JSON report from plan

[01J3FY630W590TD34DV3YZSMZD] Infracost report generated successfully
[01J3FY630W590TD34DV3YZSMZD] Mapping Infracost data to resources
[01J3FY630W590TD34DV3YZSMZD] Costs mapped successfully
[01J3FY630W590TD34DV3YZSMZD] Please be aware that the run changes calculation includes output changes.
[01J3FY630W590TD34DV3YZSMZD] Resource list upload is GO
[01J3FY630W590TD34DV3YZSMZD] Generating JSON representation of the plan...
[01J3FY630W590TD34DV3YZSMZD] JSON representation is GO
[01J3FY630W590TD34DV3YZSMZD] Generating Infracost JSON report from plan

[01J3FY630W590TD34DV3YZSMZD] Infracost report generated successfully
[01J3FY630W590TD34DV3YZSMZD] Loading custom plan policy inputs...
[01J3FY630W590TD34DV3YZSMZD] 0 custom plan policy inputs found
[01J3FY630W590TD34DV3YZSMZD] No plan policies to evaluate
```

</details>